# **Introducción al análisis de datos en Python** 
#### Profesor: Santiago Neira

## Clase 3. Pandas
Una de las habilidades más relevantes para un Data Analyst o un Data Scientist es el manejo de datos estructurados. En este tutorial aprenderá cómo importar archivos a Python para crear `DataFrames` y de esta forma manipularlos para que estos queden en el formato más conveniente para su análisis.

## Introducción a Pandas

###  ¿Qué es Pandas?
Pandas es una librería de código abierto para Python que proporciona herramientas de análisis de datos de alto rendimiento y fáciles de usar. Está construida sobre la biblioteca NumPy y proporciona estructuras de datos de alto nivel para trabajar con datos estructurados y tabulares, como hojas de cálculo y bases de datos relacionales.

Algunas de las características más importantes de Pandas son:

- Ofrece estructuras de datos para trabajar con datos tabulares, como el DataFrame y la Serie.
- Proporciona herramientas para la lectura y escritura de datos desde y hacia una variedad de formatos de archivo, como CSV, Excel, SQL, entre otros.
- Permite realizar operaciones de limpieza y preprocesamiento de datos, como la eliminación de valores perdidos o la normalización de datos.
- Ofrece una amplia variedad de métodos para el análisis de datos, como el agrupamiento, la agregación, la selección y el filtrado de datos.
- Permite la visualización de datos con la integración con otras bibliotecas de Python, como Matplotlib.

Pandas es ampliamente utilizado en ciencia de datos, finanzas, ingeniería y otras disciplinas que requieren la manipulación y el análisis de grandes conjuntos de datos. Es una de las herramientas más populares en Python para el análisis de datos debido a su facilidad de uso y su amplia gama de funciones.

En el siguiente diagrama se puede ver la estructura general de un `dataframe`, es muy similar a un Excel pero solo con una hoja. En este caso las filas representan observaciones y las columnas representan variables.

<center>
<img src="img/dataframe.png" alt="dataframe" width="500" height="300">
</center>

Comenzaremos nuestra introducción a `Pandas` creando nuestro primer `dataframe` con un diccionario.

In [5]:
!pip3 install pandas

Requirement already satisfied: pandas in c:\users\santiago neira\appdata\local\programs\python\python311\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.23.2 in c:\users\santiago neira\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\santiago neira\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\santiago neira\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\santiago neira\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\santiago neira\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.0 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
#%pip3 install pandas

In [7]:
import pandas as pd

In [8]:
# Cada variable de nuestro dataframe partirá de una lista
nombres = ["Jose", "Esteban", "Elena", "Ana", "Julian", "Juan"]
sexo = ["M", "M", "F", "F", "M", None]
edad = [24, 25, 32, 45, 52, 20]
peso = [75, 80, 60, 86, 72, 70]

In [9]:
# Creamos un diccionario con toda la información
un_diccionario = {
    "nombres": nombres,
    "sexo": sexo,
    "edad": edad,
    "peso": peso
}

In [10]:
un_diccionario

{'nombres': ['Jose', 'Esteban', 'Elena', 'Ana', 'Julian', 'Juan'],
 'sexo': ['M', 'M', 'F', 'F', 'M', None],
 'edad': [24, 25, 32, 45, 52, 20],
 'peso': [75, 80, 60, 86, 72, 70]}

In [11]:
# Construimos nuestro primer dataframe
data = pd.DataFrame(un_diccionario)

In [12]:
# Visualizamos nuestro dataframe
data

   nombres  sexo  edad  peso
0     Jose     M    24    75
1  Esteban     M    25    80
2    Elena     F    32    60
3      Ana     F    45    86
4   Julian     M    52    72
5     Juan  None    20    70

El `dataframe` es un objeto en Python que tiene unos atributos especiales. Estos atributos nos sirven para estudiar las características de nuestro objeto. Los principales se listan a continuación: 

- `.index`: es una propiedad que devuelve una lista con los nombres de fila del dataframe.

- `.columns`: es una propiedad que devuelve una lista con los nombres de las columnas del dataframe.

- `.shape`: es una propiedad que devuelve una tupla que indica el número de filas y columnas en el dataframe. Por ejemplo, un dataframe con 100 filas y 5 columnas tendría una forma de (100, 5).

- `.size`: es una propiedad que devuelve la cantidad de datos o celdas del dataframe. Por ejemplo, un dataframe con 100 filas y 5 columnas tendría un `size` de $100\times5=500$.

- `.count()`: este método cuenta la cantidad de valores no nulos por columna o fila.

- `.values`: es una propiedad que devuelve un array NumPy que contiene los valores del dataframe.

- `.T`: es un atributo que devuelve la base traspuesta.

- `.dtypes`: es una propiedad que devuelve un objeto que describe los tipos de datos de cada columna.

- `.head(n)`: es un método que devuelve las primeras n filas del dataframe.

- `.tail(n)`: es un método que devuelve las últimas n filas del dataframe.

- `.info()`: es un método que muestra información sobre el dataframe, incluyendo su forma, los tipos de datos de cada columna y la cantidad de valores no nulos.

- `.describe()`: es un método que muestra estadísticas descriptivas sobre el dataframe, incluyendo la media, la mediana, la desviación estándar, etc.

A continuación estudiaremos a detalle cada uno de estos métodos y atributos.

In [7]:
data

   nombres  sexo  edad  peso
0     Jose     M    24    75
1  Esteban     M    25    80
2    Elena     F    32    60
3      Ana     F    45    86
4   Julian     M    52    72
5     Juan  None    20    70

In [8]:
# .index Estudiamos los nombres del índice
data.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
# .columns ¿Cuáles son los nombres de las columnas?
data.columns

Index(['nombres', 'sexo', 'edad', 'peso'], dtype='object')

In [10]:
# .shape ¿Cuáles son las dimensiones del dataframe?
data.shape

(6, 4)

In [11]:
# .size ¿Cuántos datos tengo?
data.size

24

In [12]:
# .count() ¿Cuántos datos no nulos tengo por columna?
data.count()

nombres    6
sexo       5
edad       6
peso       6
dtype: int64

In [13]:
# .count() ¿Cuántos datos no nulos tengo por fila/observación/individuo?
data.count(axis = 1)

0    4
1    4
2    4
3    4
4    4
5    3
dtype: int64

In [14]:
# axis = 0 calcula las funciones por columna. Esta es la opción por default
# axis = 1 calcula las funciones por fila
data.count(axis = 0)

nombres    6
sexo       5
edad       6
peso       6
dtype: int64

In [15]:
# .values Convierte el dataframe en un np.array de dos dimensiones
data.values

array([['Jose', 'M', 24, 75],
       ['Esteban', 'M', 25, 80],
       ['Elena', 'F', 32, 60],
       ['Ana', 'F', 45, 86],
       ['Julian', 'M', 52, 72],
       ['Juan', None, 20, 70]], dtype=object)

In [23]:
# .T Trasponer
data.T

            0        1      2    3       4     5
nombres  Jose  Esteban  Elena  Ana  Julian  Juan
sexo        M        M      F    F       M  None
edad       24       25     32   45      52    20
peso       75       80     60   86      72    70

In [17]:
data_transpuesta = data.T

In [18]:
data.T.index

Index(['nombres', 'sexo', 'edad', 'peso'], dtype='object')

In [24]:
data.T.columns

RangeIndex(start=0, stop=6, step=1)

In [25]:
# .dtypes ¿Cuál es el tipo de cada variable?
data.dtypes

nombres    object
sexo       object
edad        int64
peso        int64
dtype: object

In [26]:
# .head() por defecto entrega las primeras 5 filas
data.head()

   nombres sexo  edad  peso
0     Jose    M    24    75
1  Esteban    M    25    80
2    Elena    F    32    60
3      Ana    F    45    86
4   Julian    M    52    72

In [27]:
# Primera fila
data.head(1)

  nombres sexo  edad  peso
0    Jose    M    24    75

In [28]:
# Primeras dos filas
data.head(2)

   nombres sexo  edad  peso
0     Jose    M    24    75
1  Esteban    M    25    80

In [29]:
# .tail() Por defecto devuelve las últimas 5 filas
data.tail()

   nombres  sexo  edad  peso
1  Esteban     M    25    80
2    Elena     F    32    60
3      Ana     F    45    86
4   Julian     M    52    72
5     Juan  None    20    70

In [30]:
# Última fila
data.tail(1)

  nombres  sexo  edad  peso
5    Juan  None    20    70

In [31]:
# Últimas dos filas
data.tail(2)

  nombres  sexo  edad  peso
4  Julian     M    52    72
5    Juan  None    20    70

In [32]:
# .info() descripción general de la estructura de la base
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   nombres  6 non-null      object
 1   sexo     5 non-null      object
 2   edad     6 non-null      int64
 3   peso     6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [33]:
# .describe() Estadísticas descriptivas de la data
data.describe()

            edad       peso
count   6.000000   6.000000
mean   33.000000  73.833333
std    12.806248   8.908797
min    20.000000  60.000000
25%    24.250000  70.500000
50%    28.500000  73.500000
75%    41.750000  78.750000
max    52.000000  86.000000

In [34]:
data.describe(include = "object")

       nombres sexo
count        6    5
unique       6    2
top       Jose    M
freq         1    3

In [35]:
data.describe(include = "all")

       nombres sexo       edad       peso
count        6    5   6.000000   6.000000
unique       6    2        NaN        NaN
top       Jose    M        NaN        NaN
freq         1    3        NaN        NaN
mean       NaN  NaN  33.000000  73.833333
std        NaN  NaN  12.806248   8.908797
min        NaN  NaN  20.000000  60.000000
25%        NaN  NaN  24.250000  70.500000
50%        NaN  NaN  28.500000  73.500000
75%        NaN  NaN  41.750000  78.750000
max        NaN  NaN  52.000000  86.000000

### Indexación y ejes
Adicionalmente, para manipular los dataframes es importante aprender como extraer fracciones de nuestra información. A esto se le conoce generalmente como *slicing*. En esta sección aprenderemos a filtrar la data por columnas y por filas. Los métodos que veremos serán.

- `[{nombre de la columna}]` y `.{nombre de la columna}`: Extracción de columnas.

- `set_index()`: Convertir una columna como índice.

- `.loc[]`: es un método para acceder a filas y columnas del dataframe por etiquetas de fila y columna.

- `.iloc[]`: es un método para acceder a filas y columnas del dataframe por índice entero.

- `.groupby()`: es un método para agrupar los datos por una o más columnas y realizar cálculos sobre los grupos resultantes.

- `.reset_index()`: Reiniciar el índice para que sea una enumeración de las filas.

- `.sort_values()`: Re-ordenar las filas.

- `.rename()`: Cambiarle el nombre a una fila o una columna.

- `.unique()`: Devuelve los valores únicos de la columna.

- `.value_counts()`: Cuenta la cantidad de valores únicos por columna.

**Extraer columnas**

Para extraer columnas tenemos dos métodos.
1. El primero consiste escribir entre corchetes cuadrados (`[]`) el nombre de la columna que se desea extraer entre comillas. Este método también permite extraer más de una columnas. Si ese es el caso, se pondría entre los corchetes cuadrados una lista con los nombres de las columnas deseadas entre comillas y separadas por comas.
2. El segundo método consiste en poner el nombre de la columna que se quiere extraer después de un punto `.`. Este método solo sirve si el nombre no está separado por espacios o caracteres especiales.

In [36]:
data

   nombres  sexo  edad  peso
0     Jose     M    24    75
1  Esteban     M    25    80
2    Elena     F    32    60
3      Ana     F    45    86
4   Julian     M    52    72
5     Juan  None    20    70

In [41]:
# Método 1
data["nombres"]

0       Jose
1    Esteban
2      Elena
3        Ana
4     Julian
5       Juan
Name: nombres, dtype: object

In [38]:
# Método 1
data[["nombres", "peso"]]

   nombres  peso
0     Jose    75
1  Esteban    80
2    Elena    60
3      Ana    86
4   Julian    72
5     Juan    70

In [39]:
columnas_deseadas = ['nombres', "peso"]
data[columnas_deseadas]

   nombres  peso
0     Jose    75
1  Esteban    80
2    Elena    60
3      Ana    86
4   Julian    72
5     Juan    70

In [ ]:
# Método 2
data.nombres

0       Jose
1    Esteban
2      Elena
3        Ana
4     Julian
5       Juan
Name: nombres, dtype: object

In [44]:
data

   nombres  sexo  edad  peso
0     Jose     M    24    75
1  Esteban     M    25    80
2    Elena     F    32    60
3      Ana     F    45    86
4   Julian     M    52    72
5     Juan  None    20    70

In [45]:
# Convertir una columna como un índice
data_con_indice_nombre = data.set_index('nombres')

In [49]:
data_con_indice_nombre.index

Index(['Jose', 'Esteban', 'Elena', 'Ana', 'Julian', 'Juan'], dtype='object', name='nombres')

In [50]:
data.set_index('nombres')

         sexo  edad  peso
nombres
Jose        M    24    75
Esteban     M    25    80
Elena       F    32    60
Ana         F    45    86
Julian      M    52    72
Juan     None    20    70

In [56]:
data['peso']

   sexo
0  M       75
1  M       80
2  F       60
3  F       86
4  M       72
5  NaN     70
Name: peso, dtype: int64

In [ ]:
# Si no sobreescribimos el objeto, no se guardan los cambios
data = data.set_index('nombres')
data

In [52]:
# Otra forma de sobreescribir el objeto sin necesidad de asignarlo es usando el argumento inplace = True, dentro
# de las funciones de Pandas
data.set_index("sexo", append = True, inplace = True)
data

        nombres  edad  peso
  sexo
0 M        Jose    24    75
1 M     Esteban    25    80
2 F       Elena    32    60
3 F         Ana    45    86
4 M      Julian    52    72
5 NaN      Juan    20    70

In [ ]:
# Para resetar el índice usamos .reset_index()
data.reset_index(inplace = True)
data

   level_0 sexo  nombres  edad  peso
0        0    M     Jose    24    75
1        1    M  Esteban    25    80
2        2    F    Elena    32    60
3        3    F      Ana    45    86
4        4    M   Julian    52    72
5        5  NaN     Juan    20    70

In [58]:
# Vuelva nombres el índice
data.set_index("nombres", inplace = True)

In [59]:
data

         level_0 sexo  edad  peso
nombres
Jose           0    M    24    75
Esteban        1    M    25    80
Elena          2    F    32    60
Ana            3    F    45    86
Julian         4    M    52    72
Juan           5  NaN    20    70

In [60]:
# Ordene por edad de menor a mayor. No guarde el valor
data.sort_values(['sexo','peso'])

         level_0 sexo  edad  peso
nombres
Elena          2    F    32    60
Ana            3    F    45    86
Julian         4    M    52    72
Jose           0    M    24    75
Esteban        1    M    25    80
Juan           5  NaN    20    70

In [61]:
# Ordene por edad de mayor a menor. No guarde el valor
data.sort_values('edad', ascending = False)

# Note que los índices se movieron!

         level_0 sexo  edad  peso
nombres
Julian         4    M    52    72
Ana            3    F    45    86
Elena          2    F    32    60
Esteban        1    M    25    80
Jose           0    M    24    75
Juan           5  NaN    20    70

In [62]:
# Cambie el nombre de la columna sexo a género
data.rename(columns = {"sexo": "género"})

         level_0 género  edad  peso
nombres
Jose           0      M    24    75
Esteban        1      M    25    80
Elena          2      F    32    60
Ana            3      F    45    86
Julian         4      M    52    72
Juan           5    NaN    20    70

In [63]:
# Valores únicos de la columna sexo
data.sexo.unique()

array(['M', 'F', nan], dtype=object)

In [65]:
# ¿Cuántos hombres y mujeres tenemos?
data["sexo"].value_counts(dropna=False)

sexo
M      3
F      2
NaN    1
Name: count, dtype: int64

In [66]:
data['edad'].value_counts()

edad
24    1
25    1
32    1
45    1
52    1
20    1
Name: count, dtype: int64

In [67]:
# Incluya los valores faltantes en el conteo
#dropna: drop nan - eliminar los valores nulos
data["sexo"].value_counts(dropna = False)

sexo
M      3
F      2
NaN    1
Name: count, dtype: int64

In [68]:
# ¿Cuál es la proporción de hombres y mujeres tenemos?
data["sexo"].value_counts(normalize = True)

sexo
M    0.6
F    0.4
Name: proportion, dtype: float64

Los métodos `.iloc` y ``.loc`` son utilizados en Pandas para acceder a los datos de un dataframe de diferentes maneras.

`.iloc` se utiliza para acceder a los datos del dataframe mediante índices enteros. Permite seleccionar filas y columnas utilizando números enteros en lugar de etiquetas de fila y columna. La sintaxis general para utilizar `.iloc` es la siguiente:

```python
dataframe.iloc[filas, columnas]
```

Donde `filas` y `columnas` son listas o arrays de números enteros que indican las filas y columnas que se desean seleccionar, respectivamente.

<center>
<div>
<img src="img/iloc2.png" width="500"/>
</div>
</center>

Por ejemplo, para seleccionar las primeras 3 filas y las primeras 2 columnas de un dataframe, se puede utilizar el siguiente código:

```python 
dataframe.iloc[:3, :2]
```

Recuerde que la indexación en python empieza en 0. A continuación puede encontrar una referencia gráfica:
<center>
<img src="img/iloc1.png" alt="indexación" width="450" height="200">
</center>

Por otro lado, `.loc` se utiliza para acceder a los datos del dataframe mediante etiquetas de fila y columna. Permite seleccionar filas y columnas utilizando las etiquetas de fila y columna en lugar de índices enteros. La sintaxis general para utilizar `.loc` es la siguiente:

```python
dataframe.loc[filas, columnas]
```

Donde `filas` y `columnas` son listas o arrays de etiquetas de fila y columna que indican las filas y columnas que se desean seleccionar, respectivamente.

<center>
<div>
<img src="img/iloc3.png" width="500"/>
</div>
</center>

Por ejemplo, para seleccionar todas las filas donde la columna "edad" es mayor o igual a 30, se puede utilizar el siguiente código:

```python
dataframe.loc[dataframe['edad'] >= 30, :]
```

En resumen, `.iloc` se utiliza para acceder a los datos mediante índices enteros, mientras que `.loc` se utiliza para acceder a los datos mediante etiquetas de fila y columna. Ambos métodos son muy útiles para la selección y manipulación de datos en Pandas.

In [87]:
data

         level_0 sexo  edad  peso
nombres
Jose           0    M    24    75
Esteban        1    M    25    80
Elena          2    F    32    60
Ana            3    F    45    86
Julian         4    M    52    72
Juan           5  NaN    20    70

In [88]:
data.iloc[1:3,1:]

        sexo  edad  peso
nombres
Esteban    M    25    80
Elena      F    32    60

In [89]:
# Extraiga la fila de Ana usando .loc
data.loc['Ana',['edad','sexo']]

edad    45
sexo     F
Name: Ana, dtype: object

In [92]:
data.loc[data.edad == 45]

         level_0 sexo  edad  peso
nombres
Ana            3    F    45    86

In [94]:
data

         level_0 sexo  edad  peso
nombres
Jose           0    M    24    75
Esteban        1    M    25    80
Elena          2    F    32    60
Ana            3    F    45    86
Julian         4    M    52    72
Juan           5  NaN    20    70

In [90]:
data.loc['Ana',:]

level_0     3
sexo        F
edad       45
peso       86
Name: Ana, dtype: object

In [93]:
datos_transpuesto = data.T

In [95]:
datos_transpuesto

nombres Jose Esteban Elena Ana Julian Juan
level_0    0       1     2   3      4    5
sexo       M       M     F   F      M  NaN
edad      24      25    32  45     52   20
peso      75      80    60  86     72   70

In [97]:
datos_transpuesto['Gelver'] = [6,'M',32,78]

In [101]:
datos_transpuesto.loc[:, 'Gelver']

level_0     6
sexo        M
edad       32
peso       78
Name: Gelver, dtype: object

In [98]:
# Extraiga la columna de edad usando .loc
data.loc[:,'edad']

nombres
Jose       24
Esteban    25
Elena      32
Ana        45
Julian     52
Juan       20
Name: edad, dtype: int64

In [102]:
# Extraiga los pesos de Juan y Esteban usando .loc
data.loc[['Juan', 'Esteban'], ['peso','edad']]

         peso  edad
nombres
Juan       70    20
Esteban    80    25

In [103]:
data

         level_0 sexo  edad  peso
nombres
Jose           0    M    24    75
Esteban        1    M    25    80
Elena          2    F    32    60
Ana            3    F    45    86
Julian         4    M    52    72
Juan           5  NaN    20    70

In [104]:
data['edad']>30

nombres
Jose       False
Esteban    False
Elena       True
Ana         True
Julian      True
Juan       False
Name: edad, dtype: bool

In [105]:
data.loc[data['edad']>30,:]

         level_0 sexo  edad  peso
nombres
Elena          2    F    32    60
Ana            3    F    45    86
Julian         4    M    52    72

In [106]:
data.loc[data['peso']>70]

         level_0 sexo  edad  peso
nombres
Jose           0    M    24    75
Esteban        1    M    25    80
Ana            3    F    45    86
Julian         4    M    52    72

In [108]:
data.loc[(data['edad'] > 30) & (data['sexo'] == 'M')]

         level_0 sexo  edad  peso
nombres
Julian         4    M    52    72

In [109]:
# Extraiga a todas las personas de sexo masculino mayores a 30 años
data.loc[(data['edad'] > 30) | (data['sexo'] == 'M'),:]

         level_0 sexo  edad  peso
nombres
Jose           0    M    24    75
Esteban        1    M    25    80
Elena          2    F    32    60
Ana            3    F    45    86
Julian         4    M    52    72

In [ ]:
data.loc[(data['edad'] > 30) & (data['sexo'] == 'M')]

         level_0 sexo  edad  peso
nombres
Julian         4    M    52    72

In [ ]:
data

In [112]:
# Extraiga la segunda fila usando .iloc
data.iloc[1]

level_0     1
sexo        M
edad       25
peso       80
Name: Esteban, dtype: object

In [113]:
data.iloc[1,]

level_0     1
sexo        M
edad       25
peso       80
Name: Esteban, dtype: object

In [114]:
# Extraiga la segunda y tercera columna usando .iloc
data.iloc[:,[1,2]]

        sexo  edad
nombres
Jose       M    24
Esteban    M    25
Elena      F    32
Ana        F    45
Julian     M    52
Juan     NaN    20

In [115]:
# Extraiga la primera y última fila y segunda columna usando .iloc
data.iloc[[0,-1],[1]]

        sexo
nombres
Jose       M
Juan     NaN

In [116]:
# Reinicie el índice
data.reset_index(inplace = True, drop = False) 
data

   nombres  level_0 sexo  edad  peso
0     Jose        0    M    24    75
1  Esteban        1    M    25    80
2    Elena        2    F    32    60
3      Ana        3    F    45    86
4   Julian        4    M    52    72
5     Juan        5  NaN    20    70

In [124]:
data.loc[data['nombres']=='Ana']#[['sexo', 'peso']]

  nombres  level_0 sexo  edad  peso
3     Ana        3    F    45    86

## Pandas intermedio

### Modificación de valores
Las columnas dentro de un dataframe a su vez son un objeto. Estos se conocen como `Series` y son una estructura de datos unidimensional que contiene una secuencia de valores y una etiqueta de índice para cada uno de ellos. Se puede pensar en una serie como una columna en una hoja de cálculo o como un array unidimensional con etiquetas de índice.

Una serie de Pandas se puede crear a partir de una lista, un array NumPy, un diccionario o incluso otro objeto de serie. La etiqueta de índice por defecto para cada elemento de la serie es simplemente un rango de números enteros de 0 a n-1, donde n es el número de elementos en la serie. Sin embargo, se puede especificar etiquetas de índice personalizadas para cada elemento de la serie.

In [ ]:
type(data["nombres"])

In [ ]:
data

Podemos comenzar editando valores o celdas particulares. Por ejemplo, el sexooo de Juan está como nulo. Vamos a definirlo como masculino

In [ ]:
data.loc[data.nombres == "Juan", "sexo"]

In [ ]:
data.loc[data.nombres == "Juan", "sexo"] = "M"

In [ ]:
data

Del mismo modo, también podemos editar columnas. Actualmente tenemos la edad en años, pasemosla a días.

In [ ]:
data["edad"]*365

In [ ]:
data["edad"] = data["edad"]*365

In [ ]:
data

También podemos crear una nueva variable

In [ ]:
data["nueva_variable"] = [1,2,3,np.nan,np.nan,np.nan]

In [ ]:
data

Otro método para crear una nueva variable es usando el método `.assign()`

In [ ]:
data = data.assign(nueva_variable2 = np.nan)
data

In [ ]:
data['edad'] = data['edad']/365
data['edad_dias'] = data['edad']*365

In [ ]:
data

In [ ]:
data.loc[data.edad<=24,'nueva_variable'] = 'Rango 1: 18-24'

In [ ]:
data.loc[data.edad<=24,'nueva_variable'] = 'Rango 1: 18-24'
data.loc[(data.edad>=25) & (data.edad<=32),'nueva_variable'] = 'Rango 2: 25-32'
data.loc[(data.edad>=33) & (data.edad<=54),'nueva_variable'] = 'Rango 3: 33-54'
data.loc[(data.edad>=55),'nueva_variable'] = 'Rango 4: 55+'
data

El valor con el que se modifica cada variable no tiene que ser el mismo para todas.

In [ ]:
apellido = ["Urrutia", "Carvajal", "Gómez", "Tobón", "Pardo", "Lopez"]

In [ ]:
data["nombres"] = data["nombres"] + " " + apellido

In [ ]:
data

### Estadísticas descriptivas
Anteriormente pudimos ver como el método `.describe()` me daba un resumen de toda la base. Sin embargo, en esta sección veremos cada una de las principales funciones para sacar las estadísticas

In [ ]:
data.describe()

In [ ]:
# Suma de todas las columnas
data.sum(axis=0)

In [ ]:
data

In [ ]:
# Suma por fila
data.sum(axis = 1, numeric_only = True)

In [ ]:
# Suma de toda la columna peso
data["peso"].sum()

In [ ]:
# Dato mínimo por columna
data.min()

In [ ]:
# Dato máximo por columna
data.max()

In [ ]:
data

In [ ]:
# ¿Cuál es el id de la persona que tiene la edad mínima?
data.edad.idxmin()

In [ ]:
# Juan López tiene la edad mínima
data.iloc[data.edad.idxmin(),]

In [ ]:
# ¿Cuál es el índice de la persona con mayor peso?
data.peso.idxmax()

In [ ]:
data.loc[data.peso.idxmax(),]

In [ ]:
# Media de las variables
data.mean(numeric_only = True)

In [ ]:
data

In [ ]:
# Datos medianos
data.median(numeric_only = True)

In [ ]:
data.reset_index(inplace=True)

In [ ]:
data['nombres'] = data['nombres'] + ' López'

In [ ]:
data

In [ ]:
data.set_index('nombres')

### Aplicar funciones a las columnas
En Pandas, el método `apply` se utiliza para aplicar una función a una serie o a un dataframe. El método `apply` toma como argumento una función y la aplica a cada elemento de la serie o del dataframe, devolviendo una nueva serie o dataframe con los resultados de la función aplicada a cada elemento.

La función que se aplica en el método `apply` puede ser una función lambda o una función definida por el usuario. Esta función debe tomar como argumento un elemento de la serie o dataframe y devolver el resultado de aplicar la función al elemento.

El método `apply` se puede aplicar de varias formas en un dataframe:

- Aplicar una función a una columna específica: Se puede utilizar el método `apply` en una columna específica de un dataframe utilizando la siguiente sintaxis:

```python
dataframe["nombre_columna"].apply(funcion)
```

Donde "nombre_columna" es el nombre de la columna en la que se desea aplicar la función y "funcion" es la función que se desea aplicar a cada elemento de la columna.

- Aplicar una función a un dataframe completo: Se puede utilizar el método `apply` en un dataframe completo utilizando la siguiente sintaxis:

```python
dataframe.apply(funcion)
```

Donde "funcion" es la función que se desea aplicar a cada elemento del dataframe.

- Aplicar una función a una fila específica: Se puede utilizar el método `apply` en una fila específica de un dataframe utilizando la siguiente sintaxis:

```python
dataframe.loc[etiqueta_fila].apply(funcion)
```

Donde "etiqueta_fila" es la etiqueta de la fila en la que se desea aplicar la función y "funcion" es la función que se desea aplicar a cada elemento de la fila.

- el método `apply` también puede ser utilizado con funciones **lambda**, que son funciones anónimas y pequeñas que se definen dentro de una línea de código. Por ejemplo, si se quisiera aplicar una función **lambda** que tome como entrada una cadena de caracteres y devuelva la versión en mayúsculas de la misma, se podría utilizar el método apply de la siguiente manera:

```python
dataframe['nombre_columna'].apply(lambda x: x.upper())
```

<center>
<div>
<img src="img/lambda.png" width="200"/>
</div>

<div>
<img src="img/lambda1.png" width="200"/>
</div>
</center>

El método `apply` también puede aplicarse a múltiples columnas o filas utilizando la opción axis. Si `axis=0`, la función se aplicará a cada columna del dataframe. Si `axis=1`, la función se aplicará a cada fila del dataframe.

En resumen, el método `apply` se utiliza en Pandas para aplicar una función a una serie o dataframe, y puede utilizarse de diferentes maneras para aplicar la función.

In [ ]:
data

In [ ]:
# Multiplicar x 2 todas las celdas
data.apply(lambda i: i*2)

In [ ]:
# Convertir la edad de días a años
data["edad_dias"].apply(lambda x: x/365)

In [ ]:
def funcion_ayuda(x):
    return x/365

In [ ]:
data.edad_dias.apply(funcion_ayuda)

In [ ]:
data[['edad','peso']].apply(np.mean)

In [ ]:
data[['edad','peso']].max()

### Eliminar filas y columnas

In [ ]:
data

In [ ]:
# Borre la fila identificada como 1
data.drop(1)

In [ ]:
# Borre la columna nueva_variable y nueva_variable2
data.drop(columns = ["index", "nueva_variable2"], inplace = True)

In [ ]:
data

In [ ]:
# Creemos un valor faltante
data.loc[0, "nombres"] = np.nan

In [ ]:
data

In [ ]:
# Eliminamos las filas con valores faltantes
data.dropna()

La función `pd.concat` en Pandas se utiliza para concatenar dos o más objetos de Pandas a lo largo de un eje específico. Los objetos de Pandas pueden ser dataframes o series. La concatenación implica unir los objetos uno al lado del otro o uno debajo del otro, dependiendo del eje especificado.

La sintaxis básica de `pd.concat` es la siguiente:
```python
pd.concat(objetos, axis = 0, join = 'outer', ignore_index = False)
```
Donde:

- `objetos`: es una lista o tupla de objetos de Pandas que se desea concatenar.
- `axis`: especifica el eje a lo largo del cual se realizará la concatenación. Si `axis=0`, se concatenarán los objetos uno debajo del otro (verticalmente). Si `axis=1`, se concatenarán los objetos uno al lado del otro (horizontalmente).
- `join`: especifica el tipo de unión que se desea realizar. Puede ser `'inner'` (intersección de los índices), `'outer'` (unión de los índices) o `'left'` (unión de los índices del objeto en el lado izquierdo).
- `ignore_index`: especifica si se deben ignorar los índices originales y crear nuevos índices. Si es `True`, se crearán nuevos índices.

La función `pd.concat` **es muy útil para combinar dataframes o series que tienen columnas o índices en común**. Por ejemplo, si se tienen dos dataframes que comparten las mismas columnas y se desea combinarlos verticalmente, se podría utilizar el siguiente código:

In [ ]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df1

In [ ]:
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})
df2

In [ ]:
nuevo_df = pd.concat([df1, df2], axis=0)
nuevo_df.reset_index(drop=True)

En este caso, se utilizará `axis=0` para concatenar los dataframes verticalmente. Los índices de los dataframes originales se conservarán en el nuevo dataframe.

La función `pd.concat` también puede ser utilizada para combinar dataframes o series que no tienen columnas o índices en común. En este caso, las columnas o índices faltantes se rellenarán con valores nulos. Por ejemplo, si se quisiera combinar horizontalmente dos dataframes que tienen diferentes columnas, se podría utilizar el siguiente código:

In [ ]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df1

In [ ]:
df2 = pd.DataFrame({'C': [5, 6], 'D': [7, 8]})
df2

In [ ]:
nuevo_df = pd.concat([df1, df2], axis=1)
nuevo_df

En este caso, se utilizará `axis=1` para concatenar los dataframes horizontalmente. Como los dataframes no tienen columnas en común, se crearán nuevas columnas con valores nulos.

En resumen, la función `pd.concat` en Pandas es una herramienta muy útil para combinar dataframes o series a lo largo de un eje específico. Se puede utilizar con diferentes parámetros para personalizar la unión de los objetos y crear un nuevo dataframe o serie.

In [ ]:
data

In [ ]:
# Creemos una nueva fila
nueva_fila = pd.DataFrame({"nombres": "Andrea Saldarriaga", "sexo": "F", "edad": 32, "peso": 60,'nueva_variable':'Rango 2: 25-32','edad_dias':12000}, index = [0])

In [ ]:
nueva_fila

In [ ]:
data = pd.concat((data, nueva_fila), axis = 0)
data

In [ ]:
# Creemos una fila duplicada
data = pd.concat((data, data.iloc[1:2,]), axis = 0)

In [ ]:
data

In [ ]:
# Eliminemos duplicados. Conserva la primera observación
data = data.drop_duplicates()
data

In [ ]:
data.reset_index(drop=True,inplace=True)
data

In [ ]:
data2 = pd.DataFrame({'direccion':['Cra 14','Calle 3','Carrera 4','Calle 72','Carrera 24','Calle 127']})

In [ ]:
data2

In [ ]:
pd.concat([data,data2],axis=1)

In [ ]:
data.drop_duplicates(subset='sexo')

In [ ]:
data

In [ ]:
data2

In [ ]:
pd.concat([data,data2],axis=1)

## Ejercicio 1

Para el siguiente ejercicio, usted importará el archivo `consumo_masivo_col.xslx`. Este dataset contiene los productos disponibles en los dos supermercados más grandes de Colombia, en el se incluye la marca, producto, precio en diferentes puntos de corte durante el año 2019. Primero, una introducción a como leer este archivo.

In [ ]:
!pip3 install openpyxl

Collecting openpyxl
  Using cached openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Using cached et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Using cached openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Using cached et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 24.0 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [24]:
#ruta_archivo = '/content/consumo_masivo_col.xlsx' #Para GoogleColab
ruta_archivo = './datos/consumo_masivo_col.xlsx' #Para local
productos_consumo_masivo = pd.read_excel(ruta_archivo)

#### Accediendo a los archivos a través del paquete os

In [ ]:
import os
os.getcwd()
#os.chdir("Ingrese_su_ruta_aqui")
#os.getcwd()

In [ ]:
#productos_consumo_masivo = pd.read_excel('consumo_masivo_col.xlsx')

### Trabajando con fechas al importar un archivo de excel

In [25]:
productos_consumo_masivo['date'].head()

0    20190609
1    20190609
2    20190609
3    20190609
4    20190609
Name: date, dtype: int64

In [26]:
productos_consumo_masivo['date'] = pd.to_datetime(productos_consumo_masivo['date'],format='%Y%m%d')

### Trabajando con valores numéricos al importar un archivo de excel

In [27]:
productos_consumo_masivo['prod_unit_price'].head()

0    15590
1    13993
2    16513
3    14990
4    34990
Name: prod_unit_price, dtype: object

In [28]:
productos_consumo_masivo['prod_unit_price'].dtype

dtype('O')

In [29]:
productos_consumo_masivo['prod_unit_price'].astype(float)

ValueError: could not convert string to float: '70386,95'

In [30]:
productos_consumo_masivo['prod_unit_price'] = pd.to_numeric(productos_consumo_masivo['prod_unit_price'].astype(str).str.replace(',', '.'),errors='coerce')

In [31]:
productos_consumo_masivo.head()

,date,prod_id,prod_name,prod_name_long,prod_brand,category,subcategory,tags,prod_unit_price,prod_units,prod_icon,prod_source,source_type
0,2019-06-09,7702155021451,Limpia tapicería en espuma Binner,Limpia tapicería en espuma Binner x 400ml,BINNER,Supermercado,Aseo de hogar,Alfombras,15590.0,Unidades,../icons/SVG/53-places/home-3.svg,VERDE,1
1,2019-06-09,7702155016457,Limpia tapicería y alfombras Binner,Limpia tapicería y alfombras Binner x 500ml,BINNER,Supermercado,Aseo de hogar,Alfombras,13993.0,Unidades,../icons/SVG/53-places/home-3.svg,VERDE,1
2,2019-06-09,4008455446318,Limpiador Dr. Beckmann alfombras 2en1 poder oxi,Limpiador Dr. Beckmann alfombras 2en1 poder ox...,DR.BECKMANN,Supermercado,Aseo de hogar,Alfombras,16513.0,Unidades,../icons/SVG/53-places/home-3.svg,VERDE,1
3,2019-06-09,7702532312677,Aceite Bon Aire eléctrico perfume flores,Aceite Bon Aire eléctrico perfume flores x 25 ml,BONAIRE,Supermercado,Aseo de hogar,Ambientadores,14990.0,Unidades,../icons/SVG/58-beauty-spas/spa-vapor.svg,VERDE,1
4,2019-06-09,7702532312967,Ambientador Aire Varitas Bambú Bonaire 2 Repue...,Ambientador Aire Varitas Bambú Bonaire 2 Repue...,BONAIRE,Supermercado,Aseo de hogar,Ambientadores,34990.0,Unidades,../icons/SVG/58-beauty-spas/spa-vapor.svg,VERDE,1

A partir del dataframe anterior, responda las siguientes preguntas:

1. Antes de iniciar, trate de familiarizarse un poco con la base de datos. ¿Cuántos valores de `subcategory` existen? ¿A qué corresponden? ¿Cuántos valores de `prod_units` existen? ¿A qué corresponden?
2. ¿Cuál es el rango de precios que se encuentra en esta base de datos?
3. ¿Cuál es el precio promedio de los artículos de cuidado personal?
4. ¿Cuáles son  las cinco `Galletas dulces` más costosas del mercado? ¿A qué marcas corresponden?
5. ¿Cuáles son las cinco marcas que tienen más productos por debajo de los $10,000 pesos? ¿Cuáles son? Encuentre algunos ejemplos de estos productos.
7. ¿Cuántos productos tienen como fecha Febrero de 2020? ¿Cuáles son las dos marcas con más productos en esta fecha?